.config/doom/config.org
#+title: Doom Emacs
#+author: Evan Riley

A doom emacs literate configuration. I will hopefully thoughtfully explain some decisions in here but I have no discipline so it will eventually devolve into a mess. Sorry if you're looking for something in here.

* Rudimentary stuff
** Defaults
*** Go fast
#+begin_src emacs-lisp
(use-package! gcmh
  :init
  (setq gcmh-idle-delay 10
        gcmh-high-cons-threshold (* 512 1024 1024)) ; 512MB idle GC
  :config
  (gcmh-mode 1))

(setq read-process-output-max (* 1024 1024))
(setq process-adaptive-read-buffering nil)
(setq inhibit-compacting-font-caches t)
(setq redisplay-skip-fontification-on-input t)
#+end_src

*** Basic Requirements
**** Name
Various packages require some personal information.
#+begin_src emacs-lisp
(setq user-full-name "Evan Riley"
      user-real-login-name "Evan Riley"
      user-login-name "evan"
      user-mail-address (rot13 "rina@rinaevyrl.arg"))
#+end_src

*** Authinfo
Store this in my home directory, otherwise it will get lost
#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.asc")
      auth-source-cache-expiry nil) ; default is 7200 (2h)
#+end_src
*** Sensible Defaults (for me)
#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      auto-save-interval 1000
      auto-save-timeout  30
      create-lockfiles nil
      find-file-visit-truename nil
      vc-follow-symlinks nil
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      display-time-default-load-average nil)      ; I don't think I've ever found this useful


(display-time-mode 1)                             ; Enable time in the mode-line

(global-subword-mode 1)                           ; Iterate through CamelCase words
;; Enable visual-line-mode in certain places
(add-hook! 'org-mode-hook #'visual-line-mode)
(add-hook! 'mu4e-view-mode-hook #'visual-line-mode)
(add-hook! 'mu4e-compose-mode-hook #'visual-line-mode)
(setq evil-respect-visual-line-mode t)
(after! evil
  (map! :nvmo "k" #'evil-previous-visual-line
        :nvmo "j" #'evil-next-visual-line))
#+end_src
*** Emacs
**** Whitespace
Rid me of the trailing whitespaces
#+begin_src emacs-lisp
(add-hook 'before-save-hook #'whitespace-cleanup)
#+end_src
**** Spaces
Don't add two spaces after a period. It's weird.
#+begin_src emacs-lisp
(setq-default sentence-end-double-space nil)
#+end_src

**** Tabs
Don't use tabs. Just spaces. I can re-enable them by using a =.dir-locals.el= file. Or through an LSP setting.
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))
#+end_src

**** Backup files
Please emacs, stop littering everywhere.
#+begin_src emacs-lisp
;; Disable backup files everywhere
(setq make-backup-files nil)
(setq backup-inhibited t)

(setq version-control nil
      delete-old-versions t
      kept-old-versions 0
      kept-new-versions 0)
#+end_src

**** Emacsclient
If we use an Emacslient, just reuse the already open workspace instead of creating a new one.
#+begin_src emacs-lisp
(after! persp-mode
  (setq persp-emacsclient-init-frame-behaviour-override "main"))
#+end_src
**** Customizations
By default changes made via a customization are added to init.el. I would rather have these in a seperate file.
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src
* Eye Candy
** Theme

First let's install the theme
#+begin_src emacs-lisp :tangle packages.el
;; (package! solarized-theme)
(package! auto-dark)
#+end_src

Then we can use it
#+begin_src emacs-lisp
;; (setq doom-theme 'doom-homage-black)
(setq doom-theme nil)

(after! doom-ui
  ;; set your favorite themes
  (setq custom-safe-themes t)
  (setq! auto-dark-themes '((doom-zenburn) (doom-earl-grey)))
  (auto-dark-mode))
#+end_src

** Fonts
We use [[https://usgraphics.com/products/berkeley-mono][Berkeley Mono]] here for most of our font faces.
Yes, I paid for a font.
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Berkeley Mono" :size 14)
      doom-big-font (font-spec :family "Berkeley Mono" :size 24)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 24)
      doom-symbol-font (font-spec :family "JuliaMono" :size 14)
      doom-emoji-font (font-spec :family "Twitter Color Emoji")
      doom-serif-font (font-spec :family "IBM Plex Mono" :size 22 :weight 'light))
#+end_src

Some font rendering performance changes
#+begin_src emacs-lisp
(setq inhibit-compacting-font-caches t)    ; Never compact font caches
(setq font-lock-maximum-decoration 2)       ; Reduce syntax highlighting complexity
(setq jit-lock-defer-time 0.05)            ; Shorter delay for fontification
#+end_src

** Line numbers
I like relative line numbers everywhere.
#+begin_src emacs-lisp
(setq display-line-numbers 'relative)
(setq display-line-numbers-type 'visual)          ; Move through visual lines
#+end_src

** 80 Character Column
Don't want any single lines getting too long here.
#+begin_src emacs-lisp
(setq display-fill-column-indicator-column 80)
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
#+end_src

** Buttery Smooth Scrolling
#+begin_src emacs-lisp :tangle packages.el
(package! ultra-scroll
  :recipe (:host github :repo "jdtsmith/ultra-scroll"))
#+end_src

#+begin_src emacs-lisp
(use-package! ultra-scroll
  :init
  (setq scroll-conservatively 101  ; important!
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))
#+end_src

** Window title
Shamelessly stolen from tecosaur
#+begin_src emacs-lisp
(setq frame-title-format
      '(""
        (:eval
         (if (string-match-p (regexp-quote (or (bound-and-true-p org-roam-directory) "\u0000"))
                             (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?\s buffer-file-name))
           "%b"))
        (:eval
         (when-let ((project-name (and (featurep 'projectile) (projectile-project-name))))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))
#+end_src

** Visual Bell
Visual feedback when I try to do something emacs doesn't like.
#+begin_src emacs-lisp
(setq visible-bell t)
#+end_src

* Doom Modules
Here we setup the doom ~init.el~ and configure the modules
It doesn't really matter how much you enable here, lazy loading will handle it.
