.config/doom/config.el
(use-package! gcmh
  :init
  (setq gcmh-idle-delay 10
        gcmh-high-cons-threshold (* 512 1024 1024)) ; 512MB idle GC
  :config
  (gcmh-mode 1))

(setq read-process-output-max (* 1024 1024))
(setq process-adaptive-read-buffering nil)
(setq inhibit-compacting-font-caches t)
(setq redisplay-skip-fontification-on-input t)

(setq user-full-name "Evan Riley"
      user-real-login-name "Evan Riley"
      user-login-name "evan"
      user-mail-address (rot13 "rina@rinaevyrl.arg"))

(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 7200 (2h)

(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      file-name-handler-alist-original file-name-handler-alist
      file-name-handler-alist nil
      auto-save-interval 1000
      auto-save-timeout  30
      process-adaptive-read-buffering nil
      read-process-output-max (* 4 1024 1024)
      create-lockfiles nil
      find-file-visit-truename nil
      vc-follow-symlinks nil
      password-cache-expiry nil                   ; I can trust my computers ... can't I?
      scroll-preserve-screen-position 'always     ; Don't have `point' jump around
      display-time-default-load-average nil)      ; I don't think I've ever found this useful


(display-time-mode 1)                             ; Enable time in the mode-line

(global-subword-mode 1)                           ; Iterate through CamelCase words
;; Enable visual-line-mode in certain places
(add-hook! 'org-mode-hook #'visual-line-mode)
(add-hook! 'mu4e-view-mode-hook #'visual-line-mode)
(add-hook! 'mu4e-compose-mode-hook #'visual-line-mode)
(setq evil-respect-visual-line-mode t)
(after! evil
  (map! :nvmo "k" #'evil-previous-visual-line
        :nvmo "j" #'evil-next-visual-line))

(add-hook 'before-save-hook #'whitespace-cleanup)

(setq-default sentence-end-double-space nil)

(setq-default indent-tabs-mode nil)
(add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))

;; Disable backup files everywhere
(setq make-backup-files nil)
(setq backup-inhibited t)

(setq version-control nil
      delete-old-versions t
      kept-old-versions 0
      kept-new-versions 0)

(after! persp-mode
  (setq persp-emacsclient-init-frame-behaviour-override "main"))

(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file)
  (load custom-file))

(setq doom-theme 'catppuccin)

(setq doom-font (font-spec :family "Berkeley Mono" :size 14)
      doom-big-font (font-spec :family "Berkeley Mono" :size 24)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 24)
      doom-symbol-font (font-spec :family "JuliaMono" :size 14)
      doom-emoji-font (font-spec :family "Twitter Color Emoji")
      doom-serif-font (font-spec :family "IBM Plex Mono" :size 22 :weight 'light))

(setq inhibit-compacting-font-caches t)    ; Never compact font caches
(setq font-lock-maximum-decoration 2)       ; Reduce syntax highlighting complexity
(setq jit-lock-defer-time 0.05)            ; Shorter delay for fontification

(setq display-line-numbers 'relative)
(setq display-line-numbers-type 'visual)          ; Move through visual lines

(setq display-fill-column-indicator-column 80)
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)

(use-package! ultra-scroll
  :init
  (setq scroll-conservatively 101  ; important!
        scroll-margin 0)
  :config
  (ultra-scroll-mode 1))

(setq frame-title-format
      '(""
        (:eval
         (if (string-match-p (regexp-quote (or (bound-and-true-p org-roam-directory) "\u0000"))
                             (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?\s buffer-file-name))
           "%b"))
        (:eval
         (when-let ((project-name (and (featurep 'projectile) (projectile-project-name))))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))

(setq visible-bell t)
