dot_config/doom/packages.el
(package! auto-dark)

(package! ultra-scroll
  :recipe (:host github :repo "jdtsmith/ultra-scroll"))
