.config/doom/config.el

(defun modeline-contitional-buffer-encoding ()
  "Hide \"LF UTF-8\" in modeline.
It is expected of files to be encoded with LF UTF-8, so only show
the encoding in the modeline if the encoding is worth notifying
the user."
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))
(setq doom-modeline-enable-word-count nil)      ; Disable word counting
(setq doom-modeline-continuous-word-count-modes nil)
(setq doom-modeline-checker-simple-format t)    ; Simpler checker format

(add-hook 'after-change-major-mode-hook #'modeline-contitional-buffer-encoding)
