dot_config/doom/packages.el

(package! copilot
  :recipe (:host github :repo "copilot-emacs/copilot.el" :files ("*.el")))

(package! copilot-chat
  :recipe (:host github :repo "chep/copilot-chat.el" :files ("*.el")))

(unpin! org)
