dot_config/doom/packages.el

(package! org-contrib
  :recipe (:host github :repo "emacsmirror/org-contrib"
           :files ("lisp/*.el"))
  :pin "351c71397d893d896a47ad7e280607b4d59b84e4")

(package! org-roam-ui)
(package! org-modern)

(package! doct
