dot_config/doom/packages.el

(package! org-super-agenda :pin "51c9da5ce7b791150758984bab469d2222516844")
