.config/doom/config.org
*** Mu4e

Let's read our emails inside emacs
#+begin_src emacs-lisp
(after! mu4e
    (setq mu4e-change-filenames-when-moving t
        mu4e-maildir "~/.maildir/"
        mu4e-sent-folder "/personal/Sent"
        mu4e-drafts-folder "/personal/Drafts"
        mu4e-trash-folder "/personal/Trash"
        mu4e-refile-folder "/personal/Archive"
        mu4e-get-mail-command "mbsync personal"
        mu4e-update-interval nil
        mu4e-index-update-in-background t
        ;; as of PR:7725 for doomemacs, this is how you disable mu4e notifications
        ;; mu4e-alerts is no longer used
        ;; this took longer to figure out than I would like to admit
        mu4e-notification-support nil
        mu-index-cleanup nil
        mu4e-sent-messages-behavior 'sent
        mu4e-index-lazy-check t
        message-kill-buffer-on-exit t
        auth-sources '("~/.authinfo.asc")
        message-auto-save-directory nil
        message-kill-buffer-query nil
        mu4e-view-prefer-html nil
        mu4e-view-html-plaintext-ratio-heuristic 20
        mu4e-headers-results-limt 500
        mu4e-view-use-gnus t
        ;; Configure Gnus view preferences
        gnus-blocked-images ".*"
        mm-automatic-display-p nil
        mm-inline-text-html-with-images nil
        mm-text-html-renderer 'gnus-w3m
        ;; Prefer plain text over HTML
;;        mm-discouraged-alternatives '("text/html" "text/richtext")
        ;; Don't render HTML

        ;; SMTP settings
        sendmail-program "/usr/bin/msmtp"
        send-mail-function 'smtpmail-send-it
        message-sendmail-f-is-evil t
        message-sendmail-extra-arguments '("--read-envelope-from")
        message-send-mail-function 'message-send-mail-with-sendmail
        smtpmail-smtp-server "smtp.fastmail.com"
        smtpmail-smtp-service 587
        smtpmail-stream-type 'starttls
        smtpmail-debug-info t
        smtpmail-debug-verb t
        smtpmail-timeout 10

        ;; User settings
        user-mail-address "evan@evanriley.net"
        mail-user-agent 'mu4e-user-agent

        ;; Compose settings
        message-citation-line-format nil
        message-citation-line-function nil
        mu4e-compose-dont-save-draft-files t

        ;; View settings
        mu4e-view-show-addresses t
        mu4e-use-fancy-chars t
        mu4e-attachment-dir "~/Downloads"
        ;; Better handling of HTML
        mm-inline-large-images nil             ;; Never inline large images
        ;; Improve performance
        mu4e-headers-auto-update t             ;; Update headers automatically
        mu4e-hide-index-messages t             ;; Less noise in minibuffer
        ;; Better compose handling
        mu4e-compose-complete-addresses t       ;; Better address completion
        mu4e-compose-complete-only-personal t

        ;; Headers
        mu4e-headers-date-format "%Y-%m-%d %H:%M"
        mu4e-headers-fields '((:date . 20)
                            (:flags . 6)
                            (:from . 22)
                            (:subject))

        ;; Context
        mu4e-context-policy 'pick-first
        mu4e-compose-context-policy 'always-ask)
    (setq mu4e-bookmarks
        '((:name "Inbox"
           :query "maildir:/personal/INBOX"
           :key ?i)
          (:name "Archive"
           :query "maildir:/personal/Archive"
           :key ?a)
          (:name "Unread messages"
           :query "flag:unread AND NOT flag:trashed"
           :key ?u)
          (:name "Today's messages"
           :query "date:today..now"
           :key ?t)
          (:name "Last 7 days"
           :query "date:7d..now"
           :key ?w)
          (:name "With images"
           :query "mime:image/*"
           :key ?p)
          (:name "Flagged"
           :query "flag:flagged"
           :key ?f)))
    (setq epg-pinentry-mode 'loopback)
    (if (string= (daemonp) "server")
        (setenv "INSIDE_EMACS" "true")))

#+end_src

Immediately update database and remote after I execute marks.
#+begin_src emacs-lisp
(after! mu4e

  (defun my-mu4e-mark-execute-advice (&rest _)
    (mu4e-update-mail-and-index t))

  ;; Function to update index and show new mail
  (defun my-mu4e-update-and-show ()
    "Update mail index and refresh mu4e view"
    (mu4e-update-mail-and-index t)
    ;; Give some time for the index to update
    (run-with-timer 2 nil #'mu4e-headers-rerun-search))

  ;; Add advice to run after mark execution
  (advice-add 'mu4e-mark-execute-all :after #'my-mu4e-mark-execute-advice))

#+end_src

** Projects
#+begin_src emacs-lisp
(after! projectile
  (setq projectile-enable-caching t)           ; Enable project file caching
  (setq projectile-indexing-method 'alien)     ; Use external tools for indexing
  (setq projectile-files-cache-expire 604800)
  (setq projectile-project-search-path '("~/Code/Personal" "~/Code/Work/")
        projectile-auto-discover t))
#+end_src

** Editor
*** LSP
Just some LSP performance boosts
#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-idle-delay 0.5)                    ; Delay before processing
  (setq lsp-file-watch-threshold 2000))        ; Limit watched files
#+end_src

*** Scroll Margins
Sets top and bottom scroll margins dynamically based on window size
#+begin_src emacs-lisp
(defun my/define-scroll-margins ()
  "Set the scroll margins dynamically based on the current window height."
  (let ((minimum-window-height 14))
    (let ((percent-margin 0.1))
      (setq scroll-margin
            (if (<= (window-body-height) minimum-window-height)
                0
              (floor (* (window-body-height) (* percent-margin 2))))))))
(add-hook 'window-configuration-change-hook #'my/define-scroll-margins)
#+end_src
