.config/doom/config.el

(after! projectile
  (setq projectile-enable-caching t)           ; Enable project file caching
  (setq projectile-indexing-method 'alien)     ; Use external tools for indexing
  (setq projectile-files-cache-expire 604800)
  (setq projectile-project-search-path '("~/Code/Personal/" "~/Code/Work/")
        projectile-auto-discover t))

(after! lsp-mode
  (setq lsp-idle-delay 0.5)                    ; Delay before processing
  (setq lsp-file-watch-threshold 2000))        ; Limit watched files

(defun my/define-scroll-margins ()
  "Set the scroll margins dynamically based on the current window height."
  (let ((minimum-window-height 14))
    (let ((percent-margin 0.1))
      (setq scroll-margin
            (if (<= (window-body-height) minimum-window-height)
                0
              (floor (* (window-body-height) (* percent-margin 2))))))))
(add-hook 'window-configuration-change-hook #'my/define-scroll-margins)
